## Terraform Apply Output
<details><summary>Click to expand</summary>

```terraform
random_id.storage_account: Refreshing state... [id=Nbsepw]
data.azuread_application_published_app_ids.well_known: Reading...
data.azuread_client_config.current: Reading...
data.azuread_user.this: Reading...
data.azuread_client_config.current: Read complete after 0s [id=1d31fb92-1bb7-4152-bc61-24f6b51841d1-04b07795-8ddb-461a-bbee-02f9e1bf7b46-e42e416c-221f-44e6-88db-44fd1601b9d7]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_user.this: Read complete after 1s [id=371fcda5-d60f-427b-8e13-5ee7742566c7]
azuread_application.this: Refreshing state... [id=/applications/8a03b10b-dfdc-4efd-9562-6908fffd46c2]
data.azurerm_subscription.this: Reading...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/e135f274-9024-40cf-87e9-a8afb4a1a687/resourceGroups/serbeniuk]
data.azurerm_subscription.this: Read complete after 0s [id=/subscriptions/e135f274-9024-40cf-87e9-a8afb4a1a687]
azurerm_storage_account.tfstate: Refreshing state... [id=/subscriptions/e135f274-9024-40cf-87e9-a8afb4a1a687/resourceGroups/serbeniuk/providers/Microsoft.Storage/storageAccounts/tfstate35bb1ea7]
azuread_application_federated_identity_credential.env-dev: Refreshing state... [id=8a03b10b-dfdc-4efd-9562-6908fffd46c2/federatedIdentityCredential/64e93ed2-e122-46d5-a1b3-ca364e546af5]
azuread_application_federated_identity_credential.main: Refreshing state... [id=8a03b10b-dfdc-4efd-9562-6908fffd46c2/federatedIdentityCredential/a129d2d5-2e6e-45d4-902a-8bd5031586fb]
azuread_application_federated_identity_credential.pr: Refreshing state... [id=8a03b10b-dfdc-4efd-9562-6908fffd46c2/federatedIdentityCredential/97dc727c-9675-459e-9113-8fa415e33fa4]
azuread_application_password.this: Refreshing state... [id=8a03b10b-dfdc-4efd-9562-6908fffd46c2/password/67ed1e1f-7d29-4a0d-86b1-4229cf8204f0]
azuread_application_federated_identity_credential.env-prod: Refreshing state... [id=8a03b10b-dfdc-4efd-9562-6908fffd46c2/federatedIdentityCredential/1f3ad1a3-b956-46cd-b4bc-0816cc133880]
azuread_service_principal.this: Refreshing state... [id=e42e416c-221f-44e6-88db-44fd1601b9d7]
azurerm_role_assignment.sub-contributor: Refreshing state... [id=/subscriptions/e135f274-9024-40cf-87e9-a8afb4a1a687/providers/Microsoft.Authorization/roleAssignments/f0410f6b-8503-c8f2-d19b-37f980632fdf]
azurerm_storage_container.tfstate: Refreshing state... [id=https://tfstate35bb1ea7.blob.core.windows.net/tfstate]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tls_private_key.vm_ssh_key will be created
  + resource "tls_private_key" "vm_ssh_key" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 1 to add, 0 to change, 0 to destroy.
tls_private_key.vm_ssh_key: Creating...
tls_private_key.vm_ssh_key: Creation complete after 0s [id=6658c1a82ab6ac5607a38a0439bfbc5195b5cd97]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

sp_application_name = "tf-oidc-test-sample"
```
</details>